package com.etong.android.jxappfours.find_car.grand.road_assistance;

import com.etong.android.jxappfours.find_car.grand.bean.FC_roadassiBean;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by Ellison.Sun on 2016/9/9.
 */
public class FC_roadassisData {

    private static final String[] strCompanyName = new String[]{
            "长沙市广大出租汽车点召服务有限公司",                  //  0731-82783673
            "弘高融资租赁有限公司",                                 //  4000730888
            "湖南津湘汽车维修有限公司",                             //          0731-84539312
            "湖南易通达社区汽车服务有限公司",                    //      4000730888
            "湖南新达汽车销售服务有限公司",                     //      400-815-8463
            "湖南万乘汽车贸易有限公司",                       //      0731-89671234
            "湖南新城汽车有限公司",                         //          400-818-6928
            "常德万通汽车销售服务有限公司",                     //      400-910-9492
            "长沙汇顺汽车销售服务有限公司",                     //      400-817-9378
            "湖南天和汽车销售服务有限公司",                     //      400-810-5043
            "长沙天诺汽车销售服务有限公司",                     //      400-815-2850
            "湖南华达汽车销售服务有限公司",                     //      0731-82878999
            "湖南华隆汽车销售服务有限公司",                     //      0731-82818073
            "怀化津湘天泽汽车销售服务有限公司",                   //   400-817-9439
            "岳阳彤达丰田汽车销售服务有限公司",                   //   0730-8759666
            "衡阳津湘万华汽车销售服务有限公司",                   //   400-919-2998
            "怀化津湘盈丰汽车销售服务有限公司",                   //   400-919-7798
            "长沙汇征汽车销售服务有限公司",                     //      400-817-6327
            "湖南天一汽车销售服务有限公司",                     //      0731-82977869
            "湖南万华汽车销售服务有限公司",                     //      0731－88336395
            "浏阳津湘华特汽车销售服务有限公司",                   //  400-818-0307 转 1789
            "湖南万达汽车销售服务有限公司",                     //      0731-82977960
            "郴州万马汽车销售服务有限公司",                     //      0735-2235797
            "湖南万达汽车销售服务有限公司岳阳分公司",                //  400-813-8734
            "湖南万达汽车销售服务有限公司株洲分公司",                //  0731-28895775
            "湖南万华汽车销售服务有限公司湘潭分公司",                //  400-818-0307 转 1517
            "湖南华一汽车贸易有限公司",                       //          0731-82870955
            "湖南湘晨汽车销售有限责任公司",                     //      0731-82870955
            "益阳福顺福达汽车销售服务有限公司",                   //      0737-3555999
    };

    private static final String[] userPhone = new String[]{
            "0731-82783673",
            "4000730888",
            "0731-84539312",
            "4000730888",
            "400-815-8463",
            "0731-89671234",
            "400-818-6928",
            "400-910-9492",
            "400-817-9378",
            "400-810-5043",
            "400-815-2850",
            "0731-82878999",
            "0731-82818073",
            "400-817-9439",
            "0730-8759666",
            "400-919-2998",
            "400-919-7798",
            "400-817-6327",
            "0731-82977869",
            "0731－88336395",
            "400-818-0307",     //  转 1789
            "0731-82977960",
            "0735-2235797",
            "400-813-8734",
            "0731-28895775",
            "400-818-0307",     //  转 1517
            "0731-82870955",
            "0731-82870955",
            "0737-3555999",
    };

    /**
     * 获取到公司服务电话
     *
     * @return
     */
    public static List<FC_roadassiBean> getRoadAssisData() {
        List<FC_roadassiBean> list = new ArrayList<FC_roadassiBean>();

        try {
            for (int i = 0; i < strCompanyName.length; i++) {
                FC_roadassiBean bean = new FC_roadassiBean();
                bean.setCompanyName(strCompanyName[i]);
                bean.setPhone(userPhone[i]);

                list.add(bean);
            }
        } catch (Exception e) {
        }
        return list;
    }
}
