package com.etong.android.jxbizusedcar.bean;

/**
 * @desc (车辆评估：车辆颜色数据)
 * @createtime 2016/10/25 0025--18:23
 * @Created by wukefan.
 */
public class UC_VehicleColorJsonData {

     static String jsonStr = "{"+
             "    \"paraName\": \"颜色\","+
             "    \"map\": ["+
             "    {" +
             "        \"key\": \"0\"," +
             "        \"value\": \"黑色\"," +
             "        \"rgb\": \"#000000\"" +
             "    }," +
             "    {" +
             "        \"key\": \"1\"," +
             "        \"value\": \"白色\"," +
             "        \"rgb\": \"#FFFFFF\"" +
             "    }," +
             "    {" +
             "        \"key\": \"2\"," +
             "        \"value\": \"银色\"," +
             "        \"rgb\": \"#E6E8FA\"" +
             "    }," +
             "    {" +
             "        \"key\": \"3\"," +
             "        \"value\": \"灰色\"," +
             "        \"rgb\": \"#707070\"" +
             "    }," +
             "    {" +
             "        \"key\": \"4\"," +
             "        \"value\": \"红色\"," +
             "        \"rgb\": \"#FF0000\"" +
             "    }," +
             "    {" +
             "        \"key\": \"5\"," +
             "        \"value\": \"橙色\"," +
             "        \"rgb\": \"#FFA13F\"" +
             "    }," +
             "    {" +
             "        \"key\": \"6\"," +
             "        \"value\": \"绿色\"," +
             "        \"rgb\": \"#00FF00\"" +
             "    }," +
             "    {" +
             "        \"key\": \"7\"," +
             "        \"value\": \"蓝色\"," +
             "        \"rgb\": \"#41C1FF\"" +
             "    }," +
             "    {" +
             "        \"key\": \"8\"," +
             "        \"value\": \"棕色\"," +
             "        \"rgb\": \"#99691F\"" +
             "    }," +
             "    {" +
             "        \"key\": \"9\"," +
             "        \"value\": \"紫色\"," +
             "        \"rgb\": \"#D584E9\"" +
             "    }," +
             "    {" +
             "        \"key\": \"10\"," +
             "        \"value\": \"香槟色\"," +
             "        \"rgb\": \"#EAD795\"" +
             "    }," +
             "    {" +
             "        \"key\": \"11\"," +
             "        \"value\": \"巧克力色\"," +
             "        \"rgb\": \"#6E3003\"" +
             "    }," +
             "    {" +
             "        \"key\": \"12\"," +
             "        \"value\": \"金色\"," +
             "        \"rgb\": \"#FFD943\"" +
             "    }," +
             "    {" +
             "        \"key\": \"13\"," +
             "        \"value\": \"米色\"," +
             "        \"rgb\": \"#FEF9F5\"" +
             "    }," +
             "    {" +
             "        \"key\": \"14\"," +
             "        \"value\": \"黄色\"," +
             "        \"rgb\": \"#FFF83E\"" +
             "    }" +
             "    ]"+
             "}";

    public static String getJsonData() {
        return jsonStr;

    }
}
