package com.etong.android.jxappusedcar.testData;

/**
 * @desc (这里用一句话描述这个类的作用)
 * @createtime 2016/12/28 - 17:52
 * @Created by wukefan.
 */
public class UC_FilterJsonData {

    public static String jsonStr = "{\n" +
            "    \"msg\": \"操作成功！\",\n" +
            "    \"errno\": \"PT_ERROR_SUCCESS\",\n" +
            "    \"flag\": \"0\",\n" +
            "    \"data\": [\n" +
            "        {\n" +
            "            \"minValue\": \"0\",\n" +
            "            \"unit\": \"单位:万\",\n" +
            "            \"maxName\": \"pricemax\",\n" +
            "            \"maxValue\": \"100\",\n" +
            "            \"minName\": \"pricemin\",\n" +
            "            \"remark\": \"万以下\",\n" +
            "            \"id\": \"priceJX\",\n" +
            "            \"type\": \"2\",\n" +
            "            \"intervalValue\": \"5\",\n" +
            "            \"paraName\": \"价格\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"para\": \"registercode\",\n" +
            "            \"id\": \"registerJX\",\n" +
            "            \"type\": \"1\",\n" +
            "            \"map\": [\n" +
            "                {\n" +
            "                    \"value\": \"不限\",\n" +
            "                    \"key\": \"-1\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"1年内\",\n" +
            "                    \"key\": \"0\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"1-3年\",\n" +
            "                    \"key\": \"1\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"3-5年\",\n" +
            "                    \"key\": \"2\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"5-8年\",\n" +
            "                    \"key\": \"3\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"8-10年\",\n" +
            "                    \"key\": \"4\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"10年以上\",\n" +
            "                    \"key\": \"5\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"paraName\": \"车龄\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"para\": \"mileage\",\n" +
            "            \"id\": \"mileageJX\",\n" +
            "            \"type\": \"1\",\n" +
            "            \"map\": [\n" +
            "                {\n" +
            "                    \"value\": \"不限\",\n" +
            "                    \"key\": \"-1\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"1万以内\",\n" +
            "                    \"key\": \"0\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"1万-3万\",\n" +
            "                    \"key\": \"1\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"3万-6万\",\n" +
            "                    \"key\": \"2\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"6万-10万\",\n" +
            "                    \"key\": \"3\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"10万以上\",\n" +
            "                    \"key\": \"4\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"paraName\": \"里程\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"para\": \"vehicletype\",\n" +
            "            \"id\": \"vehicletype\",\n" +
            "            \"type\": \"1\",\n" +
            "            \"map\": [\n" +
            "                {\n" +
            "                    \"value\": \"微型车\",\n" +
            "                    \"key\": \"1\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"面包车\",\n" +
            "                    \"key\": \"10\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"皮卡\",\n" +
            "                    \"key\": \"11\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"CROSS\",\n" +
            "                    \"key\": \"12\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"客车\",\n" +
            "                    \"key\": \"13\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"货车\",\n" +
            "                    \"key\": \"14\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"微卡\",\n" +
            "                    \"key\": \"15\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"小型车\",\n" +
            "                    \"key\": \"2\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"紧凑型车\",\n" +
            "                    \"key\": \"3\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"中型车\",\n" +
            "                    \"key\": \"4\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"中大型车\",\n" +
            "                    \"key\": \"5\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"SUV\",\n" +
            "                    \"key\": \"6\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"MPV\",\n" +
            "                    \"key\": \"7\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"跑车\",\n" +
            "                    \"key\": \"8\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"豪华车\",\n" +
            "                    \"key\": \"9\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"paraName\": \"级别\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"para\": \"gearmode\",\n" +
            "            \"id\": \"gearmode\",\n" +
            "            \"type\": \"1\",\n" +
            "            \"map\": [\n" +
            "                {\n" +
            "                    \"value\": \"手自一体\",\n" +
            "                    \"key\": \"0\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"自动挡\",\n" +
            "                    \"key\": \"1\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"手动档\",\n" +
            "                    \"key\": \"2\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"paraName\": \"变速箱\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"para\": \"country\",\n" +
            "            \"id\": \"country\",\n" +
            "            \"type\": \"1\",\n" +
            "            \"map\": [\n" +
            "                {\n" +
            "                    \"value\": \"国产\",\n" +
            "                    \"key\": \"1\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"进口\",\n" +
            "                    \"key\": \"2\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"value\": \"合资\",\n" +
            "                    \"key\": \"3\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"paraName\": \"国别\"\n" +
            "        }\n" +
            "    ]\n" +
            "}";
}
